---
kind: property
id: P:Autodesk.Revit.DB.BrowserOrganization.SortingParameterId
source: html/f709abcf-baa3-085c-4fdd-8ab09ee976b8.htm
---
# Autodesk.Revit.DB.BrowserOrganization.SortingParameterId Property

The Id of the parameter used to determine the sorting order of items in the browser.

## Syntax (C#)
```csharp
public ElementId SortingParameterId { get; }
```